test_cases/pehills/inputs/foam_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       5870;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       5900;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       5930;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       6030;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6000;
        startFace       6130;
    }
)

// ************************************************************************* //
