test_cases/pehills/inputs/foam_base/0.orig/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "1";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
3000
(
(-0.692446 -0.128837 -2.50102e-19 21.8364 0.5578 -9.61658e-21 1.92532e-18 4.92066e-20 -7.81618e-40)
(0.623462 -0.170518 -1.47265e-19 19.8305 -0.542043 -2.88096e-18 0 0 0)
(1.926 -0.304458 1.25826e-17 15.62 -1.81077 1.04899e-19 0 0 0)
(0.975893 -0.0579983 -4.06428e-17 5.71098 -1.07815 7.01593e-17 0 0 0)
(-3.34543 1.97918 -7.82633e-17 -4.73366 2.67039 -1.10549e-16 -1.25625e-16 7.08428e-17 -2.93769e-33)
(-4.8306 3.30398 -6.01973e-17 -6.83474 4.42708 4.87649e-19 -1.90881e-20 9.32179e-21 -1.08739e-36)
(-3.88006 2.89534 -4.75969e-16 -5.08642 3.68419 -5.7949e-16 -4.28237e-20 2.96845e-20 -7.64234e-36)
(-3.09023 2.36518 9.28152e-16 -3.84579 2.91112 5.00495e-16 -2.08181e-20 1.60635e-20 4.74927e-35)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
100
(
(0.0540057 -0.00156325 7.25644e-20 -15.7365 -0.0121958 -4.86614e-19 -2.34888e-20 -7.23315e-24 -1.40337e-39)
(0.0404528 -0.000480262 6.38035e-20 -16.1962 0.00235661 -1.42089e-18 -1.45202e-19 -5.03319e-22 1.13015e-38)
(0.0439561 0.00131382 -1.50174e-19 -16.547 -0.00235408 -1.82136e-18 -9.94412e-20 -8.62995e-23 -1.56629e-40)
(0.0608698 0.00193154 -8.64163e-20 -17.0393 -0.0266836 1.75201e-18 9.81347e-20 8.51656e-23 1.54571e-40)
(0.0747085 0.000782896 -1.12142e-18 -17.6987 -0.0453497 0 0 0 0)
(0.0779097 -0.000587157 1.13319e-18 -18.3936 -0.0464701 2.38817e-17 2.96286e-18 1.50831e-20 -6.74898e-37)
(0.0723743 -0.00127419 6.48201e-20 -19.0207 -0.0376616 -2.22682e-17 -3.03481e-18 -1.36915e-20 -6.43138e-37)
(0.0616005 -0.00153397 -1.15708e-18 -19.5268 -0.0257656 2.14152e-17 3.14487e-18 1.16158e-20 -6.40471e-37)
...
)
;
    }
    bottomWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
100
(
(-0.704892 -0.128155 -2.49998e-19 26.2047 0.318449 -4.6026e-20 1.92532e-18 4.92066e-20 -7.81618e-40)
(0.781014 -0.207115 -2.95751e-19 22.8109 -1.23433 -5.68981e-18 -4.21108e-18 9.78178e-19 3.96879e-36)
(2.16203 -0.518259 1.20852e-17 16.8087 -2.88745 -2.3998e-18 0 0 0)
(-2.27069 0.276463 4.95894e-17 -2.05712 -0.277883 2.86058e-16 -9.51551e-17 9.80282e-18 2.64464e-33)
(-7.85759 3.29322 -8.3274e-16 -12.0239 4.79348 -1.32955e-15 -1.25625e-16 7.08428e-17 -2.93769e-33)
(-7.57502 4.49005 -3.89143e-17 -10.4955 6.00919 2.88772e-17 -1.90881e-20 9.32179e-21 -1.08739e-36)
(-5.48401 3.75373 -1.76796e-15 -7.03001 4.72434 -2.14506e-15 5.68207e-17 -3.04021e-17 4.57962e-32)
(-4.12911 2.96199 2.86877e-16 -5.0584 3.60773 -2.48018e-16 -2.08181e-20 1.60635e-20 4.74927e-35)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
