test_cases/pehills/inputs/foam_base/0.orig/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
3000
(
0.00204408
0.00138269
0.000827276
5.95853e-05
0.000410121
0.000367884
0.000186357
9.78398e-05
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
100
(
0.000502085
0.000521707
0.000535903
0.000564875
0.000617518
0.000688031
0.000767218
0.000847478
...
)
;
    }
    bottomWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
100
(
0.00204408
0.00138269
0.000827276
5.95853e-05
0.000410121
0.000367884
0.000186357
9.78398e-05
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
