test_cases/pehills/inputs/foam_base/0.orig/timeScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      timeScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];


internalField   nonuniform List<scalar> 
3000
(
0.0549081
0.0550006
0.0536775
0.0487491
0.0431439
0.0404471
0.0401119
0.0415853
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0552073
0.0553299
0.0559664
0.0574748
0.0598876
0.0629391
0.0663764
0.0700501
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0549081
0.0550006
0.0536775
0.0487491
0.0431439
0.0404471
0.0401119
0.0415853
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
